### Настройки

Начинаем с импорта библиотек

In [632]:
# Импортируем библиотеки: pandas для работы с таблицами, psycopg2 для подключения к PostgreSQL
import pandas as pd
import psycopg2  # библиотека для работы с PostgreSQL

In [633]:
# Параметры подключения к БД (пример из курса).
DBNAME = 'skillfactory'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'  # Замените на ваш пароль или используйте secrets
HOST = '84.201.134.129'
PORT = 5432

Создаем соединение с заданными параметрами

In [609]:
# Создаём соединение с PostgreSQL с параметрами выше.
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT,
)

Запрос

In [ ]:
# Пример формирования SQL-запроса в строковой переменной.
# Здесь показывается использование f-строки для подставления параметров (n).
n = 10
query = f'''SELECT * 
            FROM sql.pokemon 
            LIMIT {n}
         '''
# В реальных задачах лучше использовать параметры запросов, чтобы избегать SQL-инъекций.

### Выполнение запроса

In [611]:
# Выполняем SQL-запрос и загружаем результат в DataFrame pandas.
# read_sql_query возвращает DataFrame, удобный для дальнейшего анализа и отображения.
df = pd.read_sql_query(query, connection)
df

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\95585629.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   id                       name  type1   type2  hp  attack  defense  speed
0   1                  Bulbasaur  Grass  Poison  45      49       49     45
1   2                    Ivysaur  Grass  Poison  60      62       63     60
2   3                   Venusaur  Grass  Poison  80      82       83     80
3   4      VenusaurMega Venusaur  Grass  Poison  80     100      123     80
4   7                  Charizard   Fire  Flying  78      84       78    100
5   8  CharizardMega Charizard X   Fire  Dragon  78     130      111    100
6   9  CharizardMega Charizard Y   Fire  Flying  78     104       78    100
7  16                 Butterfree    Bug  Flying  60      45       50     70
8  17                     Weedle    Bug  Poison  40      35       30     50
9  18                     Kakuna    Bug  Poison  45      25       50     35

In [612]:
# Пример подключения к другой базе 'project_sql' (переназначение параметров).
# Для смены БД достаточно изменить переменные выше и создать новое соединение.
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'  # замените при необходимости
HOST = '84.201.134.129'
PORT = 5432

connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT,
)

In [ ]:
# Задание 3.1 — загрузка таблицы vacancies полностью.
# Внимание: выборка всех строк может быть большой — в учебных целях допустимо.
n = 10  # не используется в этом запросе, оставлено из шаблона
query3_1 = f'''SELECT *
           FROM public.vacancies
        '''
# Используем словарь df для хранения нескольких DataFrame по ключам (удобно для отображения).
df = {}
df['vacancies'] = pd.read_sql_query(query3_1, connection)  # загружаем таблицу в df['vacancies']
display(df['vacancies'])  # показываем таблицу
display(df['vacancies'].shape[0])  # показываем количество строк (вакансий)

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\4008065048.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies'] = pd.read_sql_query(query3_1, connection)  # загружаем таблицу в df['vacancies']

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

49197

In [614]:
# Альтернативный способ — напрямую посчитать количество записей через COUNT(*) в SQL.
vacancies = pd.read_sql_query("SELECT COUNT(*) FROM public.vacancies", connection)
vacancies_count2 = vacancies.iloc[0, 0]  # извлекаем значение из результата
print('Vacancies:', vacancies_count2)  # выводим количество вакансий

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\604678715.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancies = pd.read_sql_query("SELECT COUNT(*) FROM public.vacancies", connection)

Vacancies: 49197

In [ ]:
# Задание 3.2 — загрузка таблицы employers и подсчёт числа работодателей.
query3_2 = f'''SELECT *
           FROM public.employers
        '''
df['employers'] = pd.read_sql_query(query3_2, connection)  # сохраняем в df['employers']
display(df['employers'])
print('Number of employers: ', df['employers'].shape[0])  # выводим количество работодателей

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\2260634080.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['employers'] = pd.read_sql_query(query3_2, connection)  # сохраняем в df['employers']

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

Number of employers:  23501

In [ ]:
# Задание 3.3 — загрузка таблицы areas и подсчёт числа регионов.
query3_3 = f'''SELECT *
           FROM public.areas
        '''
df['areas'] = pd.read_sql_query(query3_3, connection)  # сохраняем в df['areas']
display(df['areas'])
print('Number of areas: ', df['areas'].shape[0])  # выводим количество регионов

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\3029613764.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['areas'] = pd.read_sql_query(query3_3, connection)  # сохраняем в df['areas']

        id              name
0     2758           Тбилиси
1        8            Майкоп
2     1180          Нерюнгри
3     1240       Новокузнецк
4        2   Санкт-Петербург
...    ...               ...
1357  5043  Звёздный Городок
1358  3934       Воротынск\n
1359  4825             Чемал
1360  3708         Усть-Нера
1361  2432         Каневская

[1362 rows x 2 columns]

Number of areas:  1362

In [ ]:
# Задание 3.4 — загрузка таблицы industries и подсчёт числа сфер деятельности.
query3_4 = f'''SELECT *
           FROM public.industries
        '''
df['industries'] = pd.read_sql_query(query3_4, connection)
display(df['industries'])
print('Number of industries: ', df['industries'].shape[0])  # выводим количество сфер

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\3963527008.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['industries'] = pd.read_sql_query(query3_4, connection)

          id                                               name
0      7.540                Разработка программного обеспечения
1      7.539  Системная интеграция,  автоматизации технологи...
2     27.550              Безалкогольные напитки (производство)
3     27.551  Безалкогольные напитки (продвижение, оптовая т...
4     13.664             Управление и эксплуатация недвижимости
..       ...                                                ...
289   37.626             Ассоциация в сфере культуры, искусства
290   42.603                              Табак  (производство)
291   29.532                           Рыболовство, рыбоводство
292   37.627                      Благотворительная организация
293  388.505  Оборудование для деревообработки, заготовки ле...

[294 rows x 2 columns]

Number of industries:  294

In [ ]:
# Задание 4.1 — топ-5 регионов по числу вакансий.
query4_1 = f'''SELECT
              a.name area,
              COUNT(v.id) cnt
           FROM public.areas a
           JOIN public.vacancies v ON a.id = v.area_id
           GROUP BY a.id
           ORDER BY cnt DESC
           LIMIT 5
        '''
df['vacancies_num_in_area'] = pd.read_sql_query(query4_1, connection)
display(df['vacancies_num_in_area'])  # показываем результат

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\3398372907.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies_num_in_area'] = pd.read_sql_query(query4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

In [619]:
# Задание 4.2 — считаем вакансии, где указана хотя бы одна граница зарплаты.
query4_2 = f'''
    SELECT COUNT(*) AS cnt
    FROM public.vacancies
    WHERE salary_from IS NOT NULL OR salary_to IS NOT NULL
'''
df['vacancies_with_salary'] = pd.read_sql_query(query4_2, connection)
display(df['vacancies_with_salary'])  # показываем количество вакансий с указанной зарплатой

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\514206822.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies_with_salary'] = pd.read_sql_query(query4_2, connection)

     cnt
0  24073

In [620]:
# Задание 4.3 — вычисляем среднее по нижней и верхней границе зарплаты (округлено).
query4_3 = f'''
    SELECT
        ROUND(AVG(salary_from)) AS avg_salary_from,
        ROUND(AVG(salary_to)) AS avg_salary_to
    FROM public.vacancies
    WHERE salary_from IS NOT NULL OR salary_to IS NOT NULL
'''
df['avg_salary_range'] = pd.read_sql_query(query4_3, connection)
display(df['avg_salary_range'])  # показываем средние значения зарплат

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\3862245696.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['avg_salary_range'] = pd.read_sql_query(query4_3, connection)

   avg_salary_from  avg_salary_to
0          71065.0       110537.0

In [621]:
# Задание 4.4 — находим вторую по популярности пару (schedule, employment).
query4_4 = f'''
    SELECT
        schedule,
        employment,
        COUNT(*) AS cnt
    FROM public.vacancies
    GROUP BY schedule, employment
    ORDER BY cnt DESC
    OFFSET 1
    LIMIT 1
'''
df['vacancies_by_schedule_employment'] = pd.read_sql_query(query4_4, connection)
display(df['vacancies_by_schedule_employment'])  # выводим пару на 2-м месте

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1837529434.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies_by_schedule_employment'] = pd.read_sql_query(query4_4, connection)

           schedule        employment   cnt
0  Удаленная работа  Полная занятость  7802

In [ ]:
# Повторное (или обновлённое) создание соединения — на всякий случай.
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT,
)
# Задание 4.5 — сортируем варианты опыта по возрастанию количества вакансий, где указан этот опыт.
query4_5 = f'''SELECT
              v.experience,
              COUNT(v.id) experience_cnt
           FROM public.vacancies v
           GROUP BY v.experience
           ORDER BY experience_cnt ASC
        '''
df['experience_cnt'] = pd.read_sql_query(query4_5, connection)
display(df['experience_cnt'])  # показываем результат

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\3017006642.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['experience_cnt'] = pd.read_sql_query(query4_5, connection)

           experience  experience_cnt
0         Более 6 лет            1337
1           Нет опыта            7197
2       От 3 до 6 лет           14511
3  От 1 года до 3 лет           26152

In [ ]:
# Задание 5.1 — находим работодателей на 1-м и 5-м местах по числу вакансий.
query5_1 = f'''WITH emp_count AS (SELECT e.name, COUNT(v.id) cnt
           FROM public.employers e
           JOIN public.vacancies v ON e.id = v.employer_id
           GROUP BY e.id
           ORDER BY cnt DESC
        )
        SELECT *
        FROM emp_count
        WHERE cnt = (SELECT MAX(cnt) FROM emp_count)
        OR cnt = (SELECT cnt FROM emp_count ORDER BY cnt DESC OFFSET 4 LIMIT 1)
        '''
df['top_1_and_5_employers'] = pd.read_sql_query(query5_1, connection)
display(df['top_1_and_5_employers'])  # показываем топ-1 и топ-5 работодателей

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1441379016.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['top_1_and_5_employers'] = pd.read_sql_query(query5_1, connection)

            name   cnt
0         Яндекс  1933
1  Газпром нефть   331

In [624]:
# Задание 5.2 — ищем регион без вакансий с максимальным числом работодателей.
query5_2 = f'''
    SELECT a.name AS area_name,
           COUNT(e.id) AS employer_count,
           COUNT(v.id) AS vacancy_count
    FROM public.areas a
    LEFT JOIN public.employers e ON a.id = e.area
    LEFT JOIN public.vacancies v ON a.id = v.area_id
    GROUP BY a.name
    HAVING COUNT(v.id) = 0
    ORDER BY employer_count DESC
    LIMIT 1
'''
df['region_with_most_employers_no_vacancies'] = pd.read_sql_query(query5_2, connection)
display(df['region_with_most_employers_no_vacancies'])  # показываем найденный регион

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1621147886.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['region_with_most_employers_no_vacancies'] = pd.read_sql_query(query5_2, connection)

  area_name  employer_count  vacancy_count
0    Россия             410              0

In [625]:
# Задание 5.3 — считаем для каждого работодателя число уникальных регионов публикации вакансий.
query5_3 = f'''
    SELECT e.id AS employer_id,
           e.name AS employer_name,
           COUNT(DISTINCT v.area_id) AS region_count
    FROM public.employers e
    LEFT JOIN public.vacancies v ON e.id = v.employer_id
    GROUP BY e.id, e.name
    ORDER BY region_count DESC
'''
df['employer_region_counts'] = pd.read_sql_query(query5_3, connection)
display(df['employer_region_counts'])  # показываем работодателей и число регионов

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\2292151218.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['employer_region_counts'] = pd.read_sql_query(query5_3, connection)

       employer_id           employer_name  region_count
0             1740                  Яндекс           181
1             2748              Ростелеком           152
2          5724811              Спецремонт           116
3          5130287  Поляков Денис Иванович            88
4          3682876               ООО ЕФИН             71
...            ...                     ...           ...
23496      5287515              Но Смокинг             0
23497      2839354        МАСТЕРСКАЯ CREED             0
23498      5774578           Dzing Finance             0
23499      5775069                    КОРС             0
23500           15             Наука-Связь             0

[23501 rows x 3 columns]

In [ ]:
# Задание 5.4 — считаем работодателей без указания сферы деятельности.
query5_4 = f'''
    SELECT COUNT(*) AS employer_count
    FROM public.employers e
    LEFT JOIN public.employers_industries ei ON e.id = ei.employer_id
    WHERE ei.industry_id IS NULL
'''
df['employers_no_industry'] = pd.read_sql_query(query5_4, connection)
display(df['employers_no_industry'])  # показываем число таких работодателей

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\979797105.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['employers_no_industry'] = pd.read_sql_query(query5_4, connection)

   employer_count
0            8419

In [627]:
# Задание 5.5 — находим третью компанию в алфавите среди компаний с ровно 4 сферами деятельности.
query5_5 = f'''
    SELECT e.name AS employer_name
    FROM public.employers e
    JOIN public.employers_industries ei ON e.id = ei.employer_id
    GROUP BY e.id, e.name
    HAVING COUNT(ei.industry_id) = 4
    ORDER BY e.name
    LIMIT 1 OFFSET 2
'''
df['third_employer_with_four_industries'] = pd.read_sql_query(query5_5, connection)
display(df['third_employer_with_four_industries'])  # выводим название компании

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\270868556.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['third_employer_with_four_industries'] = pd.read_sql_query(query5_5, connection)

  employer_name
0          2ГИС

In [ ]:
# Задание 5.6 — считаем работодателей, у которых в списке сфер есть 'Разработка программного обеспечения'.
query5_6 = f'''
    SELECT COUNT(DISTINCT e.id) AS employer_count
    FROM public.employers e
    JOIN public.employers_industries ei ON e.id = ei.employer_id
    WHERE ei.industry_id = (
        SELECT id FROM public.industries WHERE name = 'Разработка программного обеспечения'
    )
'''
df['employers_with_software_development'] = pd.read_sql_query(query5_6, connection)
display(df['employers_with_software_development'])  # показываем результат

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1757645462.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['employers_with_software_development'] = pd.read_sql_query(query5_6, connection)

   employer_count
0            3553

In [629]:
# Задание 5.7 — для 'Яндекс' собираем вакансии по крупным городам (миллионникам) и добавляем строку Total.
query5_7 = f'''
    SELECT a.name AS area_name,
           COUNT(v.id) AS vacancy_count
    FROM public.vacancies v
    JOIN public.areas a ON v.area_id = a.id
    WHERE v.employer_id = (SELECT id FROM public.employers WHERE name = 'Яндекс')
      AND a.name IN ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск', 'Самара', 'Омск', 'Ростов-на-Дону', 'Уфа', 'Красноярск', 'Краснодар','Воронеж', 'Пермь', 'Волгоград')
    GROUP BY a.id, a.name
    UNION ALL
    SELECT 'Total' AS area_name,
           COUNT(v.id) AS vacancy_count
    FROM public.vacancies v
    WHERE v.employer_id = (SELECT id FROM public.employers WHERE name = 'Яндекс')
'''
df['yandex_millionaire_areas'] = pd.read_sql_query(query5_7, connection)
display(df['yandex_millionaire_areas'])  # выводим таблицу по Яндексу

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\3465982241.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['yandex_millionaire_areas'] = pd.read_sql_query(query5_7, connection)

          area_name  vacancy_count
0            Москва             54
1   Санкт-Петербург             42
2      Екатеринбург             39
3       Новосибирск             35
4         Волгоград             24
5           Воронеж             32
6         Краснодар             30
7        Красноярск             23
8   Нижний Новгород             36
9              Омск             21
10            Пермь             25
11   Ростов-на-Дону             25
12           Самара             26
13           Казань             25
14              Уфа             26
15        Челябинск             22
16            Total           1933

In [630]:
# Задание 6.1 — считаем вакансии, в названии которых встречаются 'data' или 'данн' (регистронезависимо).
query6_1 = f'''
    SELECT COUNT(*) AS vacancy_count
    FROM public.vacancies
    WHERE LOWER(name) LIKE '%data%' OR LOWER(name) LIKE '%данн%'
'''
df['vacancies_related_to_data'] = pd.read_sql_query(query6_1, connection)
display(df['vacancies_related_to_data'])  # показываем количество вакансий, связанных с данными

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\2411441356.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies_related_to_data'] = pd.read_sql_query(query6_1, connection)

   vacancy_count
0           1771

In [ ]:
# Задание 6.2 — ищем вакансии для начинающих DS по набору ключевых слов в названии и по признакам 'junior'.
# Запрос состоит из двух частей: детализированный список по названиям и итоговый 'total'.
query6_2 = f'''
SELECT
    v.name AS data_science_vacancy,
    COUNT(v.id) AS number_of_vacancies
FROM public.vacancies v
WHERE (
    LOWER(v.name) LIKE '%data scientist%' OR
    LOWER(v.name) LIKE '%data science%' OR
    LOWER(v.name) LIKE '%исследователь данных%' OR
    (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
    LOWER(v.name) LIKE '%machine learning%' OR
    (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
)
AND (
    LOWER(v.name) LIKE '%junior%' OR
    LOWER(v.experience) LIKE '%нет опыта%' OR
    LOWER(v.employment) LIKE '%стажировка%'
)
GROUP BY v.name

UNION ALL

SELECT
    'total' AS data_science_vacancy,
    COUNT(v.id) AS number_of_vacancies
FROM public.vacancies v
WHERE (
    LOWER(v.name) LIKE '%data scientist%' OR
    LOWER(v.name) LIKE '%data science%' OR
    LOWER(v.name) LIKE '%исследователь данных%' OR
    (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
    LOWER(v.name) LIKE '%machine learning%' OR
    (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
)
AND (
    LOWER(v.name) LIKE '%junior%' OR
    LOWER(v.experience) LIKE '%нет опыта%' OR
    LOWER(v.employment) LIKE '%стажировка%'
)

'''
df['junior_vacancies_related_to_data_science'] = pd.read_sql_query(query6_2, connection)
display(df['junior_vacancies_related_to_data_science'])  # показываем найденные вакансии

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\2280056897.py:43: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['junior_vacancies_related_to_data_science'] = pd.read_sql_query(query6_2, connection)

                                 data_science_vacancy  number_of_vacancies
0                                      Data Scientist                    1
1           Data Scientist (Computer Vision) - Junior                    1
2           Data Scientist (Computer Vision) / Junior                    1
3                             Data Scientist (Junior)                    1
4                            Data Scientist (Junior+)                    1
5                              Data Scientist, Junior                    2
6                     Data Scientist (junior+/middle)                    1
7         Data scientist (Junior/Middle) в консалтинг                    1
8   Data Scientist/Machine Learning Engineer (Deve...                    3
9             Data Scientist/ML engineer (Python/C++)                    1
10                              Data Scientist в Сбер                    1
11                       Intern/Junior Data Scientist                    1
12                            Junior+ CV/ML developer                    1
13                              Junior Data Scientist                    3
14             Junior Data Scientist for NLP (Python)                    1
15             Junior Data Scientist (Promo Forecast)                    1
16                         Junior Data Scientist (VK)                    1
17  Junior Data Scientist (Валидация скоринговых м...                    9
18  Junior Data Scientist (математик-аналитик) уда...                    1
19       Junior Data scientist/ Младший риск-аналитик                    1
20                     Junior Data Scientist (Стажер)                    1
21  Junior Data Scientist Управления модельных рис...                    1
22                       Junior/Middle Data Scientist                    1
23          Junior Research Engineer / Data Scientist                    1
24              Python developer / Junior ML engineer                    1
25                 Research Engineer / Data Scientist                    1
26                         Senior Data Scientist (AI)                    1
27          Senior Research Engineer / Data Scientist                    1
28                              Ведущий AI/ML инженер                    2
29  Исследователь в области машинного обучения и м...                    1
30     Математик, Junior/Middle/Senior Data Scientist                    1
31  Математик-аналитик (data scientist / data anal...                    1
32  Программист Python/ Data Scientist (junior / m...                    1
33            Риск - Аналитик (Junior Data scientist)                    1
34       Риск-аналитик (ML Engineer / Data Scientist)                    1
35  Стажер направления Машинное обучение и анализ ...                    1
36  Стажёр Data Scientist / Группа сервисов Антифр...                    1
37                                              total                   51

In [ ]:
# Задание 6.2 — вариант с CTE (WITH) для повышения читаемости: сначала фильтруем вакансии, затем считаем.
query6_2_2 = f'''WITH filtered_vacancies AS (
    SELECT v.name, v.id
    FROM public.vacancies v
    WHERE (
        LOWER(v.name) LIKE '%data scientist%' OR
        LOWER(v.name) LIKE '%data science%' OR
        LOWER(v.name) LIKE '%исследователь данных%' OR
        (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
        LOWER(v.name) LIKE '%machine learning%' OR
        LOWER(v.name) LIKE '%машинн%обучен%'
    )
    AND (
        LOWER(v.name) LIKE '%junior%' OR
        LOWER(v.experience) LIKE '%нет опыта%' OR
        LOWER(v.employment) LIKE '%стажировка%'
    )
)

SELECT
    name AS data_science_vacancy,
    COUNT(id) AS junior_number_of_vacancies
FROM filtered_vacancies
GROUP BY name

UNION ALL

SELECT
    'total' AS data_science_vacancy,
    COUNT(id) AS junior_number_of_vacancies
FROM filtered_vacancies;
'''
df['junior_vacancies_related_to_data_science_2'] = pd.read_sql_query(query6_2_2, connection)
display(df['junior_vacancies_related_to_data_science_2'])  # показываем результат альтернативного запроса

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\481919599.py:33: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['junior_vacancies_related_to_data_science_2'] = pd.read_sql_query(query6_2_2, connection)

,data_science_vacancy,junior_number_of_vacancies
0,Junior Research Engineer / Data Scientist,1
1,Data scientist (Junior/Middle) в консалтинг,1
2,Intern/Junior Data Scientist,1
3,Senior Data Scientist (AI),1
4,Риск - Аналитик (Junior Data scientist),1
5,Junior Data Scientist,3
6,"Data Scientist, Junior",2
7,Junior Data Scientist (Promo Forecast),1
8,Junior+ CV/ML developer,1
9,Python developer / Junior ML engineer,1
10,Стажёр Data Scientist / Группа сервисов Антифр...,1
11,Junior Data Scientist for NLP (Python),1
12,Junior Data Scientist Управления модельных рис...,1
13,Junior Data scientist/ Младший риск-аналитик,1
14,Senior Research Engineer / Data Scientist,1
15,Риск-аналитик (ML Engineer / Data Scientist),1
16,Junior Data Scientist (Валидация скоринговых м...,9
17,Математик-аналитик (data scientist / data anal...,1
18,Junior/Middle Data Scientist,1
19,Junior Data Scientist (Стажер),1
20,Ведущий AI/ML инженер,2
21,Исследователь в области машинного обучения и м...,1
22,Стажер направления Машинное обучение и анализ ...,1
23,Data Scientist (Computer Vision) - Junior,1
24,Research Engineer / Data Scientist,1
25,Junior Data Scientist (VK),1
26,Data Scientist (Junior+),1
27,Data Scientist,1
28,"Математик, Junior/Middle/Senior Data Scientist",1
29,Data Scientist (Computer Vision) / Junior,1
30,Data Scientist (junior+/middle),1
31,Data Scientist/Machine Learning Engineer (Deve...,3
32,Junior Data Scientist (математик-аналитик) уда...,1
33,Программист Python/ Data Scientist (junior / m...,1
34,Data Scientist (Junior),1
35,Data Scientist/ML engineer (Python/C++),1
36,Data Scientist в Сбер,1
37,total,51

In [ ]:
# Задание 6.3 — среди вакансий для DS смотрим, где в ключевых навыках указаны SQL или Postgres.
query6_3 = f'''WITH filtered_vacancies AS (
    SELECT v.name, v.id, v.key_skills
    FROM public.vacancies v
    WHERE (
        LOWER(v.name) LIKE '%data scientist%' OR
        LOWER(v.name) LIKE '%data science%' OR
        LOWER(v.name) LIKE '%исследователь данных%' OR
        (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
        LOWER(v.name) LIKE '%machine learning%' OR
        (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
    )
)

SELECT
    name AS data_science_vacancy,
    COUNT(id) AS number_of_vacancies_with_sql_or_postgres
FROM filtered_vacancies
WHERE LOWER(key_skills) LIKE '%sql%' OR LOWER(key_skills) LIKE '%postgres%'
GROUP BY name

UNION ALL

SELECT
    'total' AS data_science_vacancy,
    COUNT(id) AS number_of_vacancies_with_sql_or_postgres
FROM filtered_vacancies
WHERE LOWER(key_skills) LIKE '%sql%' OR LOWER(key_skills) LIKE '%postgres%';
'''
df['vacancies_with_sql_or_postgres'] = pd.read_sql_query(query6_3, connection)
display(df['vacancies_with_sql_or_postgres'])  # показываем вакансии, где указаны SQL/Postgres

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1916471967.py:30: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies_with_sql_or_postgres'] = pd.read_sql_query(query6_3, connection)

,data_science_vacancy,number_of_vacancies_with_sql_or_postgres
0,Data Science эксперт,1
1,Аналитик (data science),1
2,Data scientist (директор) в управление процесс...,1
3,Data Scientist (Middle/Senior),1
4,Разработчик Golang/Python в команду аналитики ...,1
...,...,...
151,C++ разработчик (QML),1
152,Data scientist (Прогнозирование спроса),1
153,TeamLead Analyst BI (AI Driving Data),1
154,TeamLead группы системного администрирования,1
155,total,229

In [ ]:
# Задание 6.4 — аналогично проверяем популярность Python в ключевых навыках для DS.
query6_4 = f'''WITH filtered_vacancies AS (
    SELECT v.name, v.id, v.key_skills
    FROM public.vacancies v
    WHERE (
        LOWER(v.name) LIKE '%data scientist%' OR
        LOWER(v.name) LIKE '%data science%' OR
        LOWER(v.name) LIKE '%исследователь данных%' OR
        (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
        LOWER(v.name) LIKE '%machine learning%' OR
        (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
    )
)

SELECT
    name AS data_science_vacancy,
    COUNT(id) AS number_of_vacancies_with_python
FROM filtered_vacancies
WHERE LOWER(key_skills) LIKE '%python%'
GROUP BY name

UNION ALL

SELECT
    'total' AS data_science_vacancy,
    COUNT(id) AS number_of_vacancies_with_python
FROM filtered_vacancies
WHERE LOWER(key_skills) LIKE '%python%';
'''
df['vacancies_with_python'] = pd.read_sql_query(query6_4, connection)
display(df['vacancies_with_python'])  # показываем вакансии с Python в ключевых навыках

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\2452108898.py:30: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['vacancies_with_python'] = pd.read_sql_query(query6_4, connection)

,data_science_vacancy,number_of_vacancies_with_python
0,AI/ML Senior Engineer,2
1,Analyst/Data Scientist,1
2,B2B Data Scientist (Эксперт по моделированию и...,1
3,Chief Data Science (Цифровой кредитный монитор...,1
4,Commercial Data Scientist / Эксперт по наукоем...,1
...,...,...
221,Специалист по углубленной аналитике данных (Da...,1
222,Стажёр Data Scientist / Группа сервисов Антифр...,1
223,Старший разработчик (ML engineer),1
224,Эксперт по машинному обучению и искусственному...,2
225,total,357

In [ ]:
# Задание 6.5 — считаем количество ключевых навыков (разделитель таб) в каждой вакансии и среднее значение.
# Формула: длина строки minus длина без табов + 1 даёт число элементов, разделённых табом (при наличии хотя бы одного навыка).
query6_5 = f'''WITH filtered_vacancies AS (
    SELECT 
        v.name, 
        v.id, 
        v.key_skills,
        (
            length(lower(v.key_skills)) - length(replace(lower(v.key_skills), CHR(9), '')) + 1
        ) AS key_skills_count
    FROM public.vacancies v
    WHERE (
        LOWER(v.name) LIKE '%data scientist%' OR
        LOWER(v.name) LIKE '%data science%' OR
        LOWER(v.name) LIKE '%исследователь данных%' OR
        (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
        LOWER(v.name) LIKE '%machine learning%' OR
        (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
    )
    AND v.key_skills IS NOT NULL

)

SELECT 
    name AS data_science_vacancy,
    key_skills,
    key_skills_count
FROM filtered_vacancies


UNION ALL

SELECT 
    'average_number_of_key_skills' AS data_science_vacancy,
    NULL AS key_skills,
    ROUND(AVG(fv.key_skills_count), 2) AS key_skills_count
FROM filtered_vacancies fv;
'''
df['avg_key_skills_per_vacancy'] = pd.read_sql_query(query6_5, connection)
display(df['avg_key_skills_per_vacancy'])  # показываем список и среднее количество навыков

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1337967148.py:39: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['avg_key_skills_per_vacancy'] = pd.read_sql_query(query6_5, connection)

,data_science_vacancy,key_skills,key_skills_count
0,Junior+ CV/ML developer,Python\tSQL\tРабота в команде\tOpenCV\tML,5.00
1,Data Scientist,Oracle Pl/SQL\tБазы данных\tMachine Learning\t...,9.00
2,Data Scientist (Junior+),Python\tOpenCV\tTensorflow\tComputer Vision\tН...,8.00
3,AI/ML Senior Engineer,Python\tFlask\tLinux\tAWS\tGit,5.00
4,QA Automation TeamLead,Atlassian Jira\tФункциональное тестирование\tS...,11.00
...,...,...,...
477,Middle+/Senior Data Scientist,SCALA\tSQL\tМатематический анализ\tСтатистичес...,7.00
478,ML Engineer Team Lead (to Cyprus),Python\tLinux\tKubernetes\tAWS\tGit\tPeople Ma...,6.00
479,Системный аналитик /Middle+/Senior/TeamLead,UML\tSQL\tBPMN\tSOAP\tREST\tПостановка задач р...,7.00
480,"Frontend разработчик, VueJS (Senior), TeamLead",Git\tJavaScript\tHTML\tCSS\tVue.js\tVue\tREST ...,9.00
481,average_number_of_key_skills,None,6.55

In [ ]:
# Задание 6.6 — для вакансий DS считаем среднюю запрашиваемую зарплату по типу опыта.
# Если указаны обе границы salary_from и salary_to, берём их среднее, иначе используем существующую границу.
query6_6 = f'''
WITH filtered_vacancies AS (
    SELECT 
        v.experience,
        CASE
            WHEN v.salary_from IS NOT NULL AND v.salary_to IS NOT NULL THEN (v.salary_from + v.salary_to) / 2
            WHEN v.salary_from IS NOT NULL THEN v.salary_from
            WHEN v.salary_to IS NOT NULL THEN v.salary_to
        END AS salary
    FROM public.vacancies v
    WHERE (
        LOWER(v.name) LIKE '%data scientist%' OR
        LOWER(v.name) LIKE '%data science%' OR
        LOWER(v.name) LIKE '%исследователь данных%' OR
        (LOWER(v.name) LIKE '%ml%' AND LOWER(v.name) NOT LIKE '%html%') OR
        LOWER(v.name) LIKE '%machine learning%' OR
        (LOWER(v.name) LIKE '%машинн%' AND LOWER(v.name) LIKE '%обучен%')
    )
    AND (v.salary_from IS NOT NULL OR v.salary_to IS NOT NULL)
)

SELECT
    fv.experience,
    ROUND(AVG(fv.salary)) AS avg_salary_requested
FROM filtered_vacancies fv
GROUP BY fv.experience;
'''

df['average_salary_by_experience'] = pd.read_sql_query(query6_6, connection)
display(df['average_salary_by_experience'])  # показываем среднюю зарплату по опыту

C:\Users\ekash\AppData\Local\Temp\ipykernel_18708\1990054231.py:31: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df['average_salary_by_experience'] = pd.read_sql_query(query6_6, connection)

           experience  avg_salary_requested
0       От 3 до 6 лет              256454.0
1  От 1 года до 3 лет              144233.0
2         Более 6 лет              157933.0
3           Нет опыта               74643.0

### Финал

In [ ]:
# Закрываем соединение с базой по завершении работы — хорошая практика.
connection.close()